{
  "act_fn": "relu",
  "architectures": [
    "ST_LinearForTrafficPrediction"
  ],
  "attn_dropout": 0.0,
  "attn_output_dropout": 0.0,
  "attn_query_dropout": 0.0,
  "channel_dim": 7,
  "dtype": "float32",
  "encode_dropout": 0.0,
  "ffn_1_dropout": 0,
  "ffn_2_dropout": 0.5,
  "layers": 1,
  "model_type": "st_linear",
  "num_heads": 8,
  "patch_size": 16,
  "pred_len": 96,
  "projection_dim": 96,
  "rec_dim": 96,
  "rec_query_dropout": 0.0,
  "seq_len": 96,
  "spatio_topk": 3,
  "temperature": 0.1,
  "temporal_dim": 96,
  "temporal_ffn": 96,
  "temporal_proj": false,
  "transformers_version": "5.3.0",
  "use_cache": false
}
