{
  "act_fn": "relu",
  "architectures": [
    "ST_LinearForTrafficPrediction"
  ],
  "attn_dropout": 0.0,
  "attn_output_dropout": 0.0,
  "attn_query_dropout": 0.0,
  "channel_dim": 100,
  "dtype": "float32",
  "encode_dropout": 0.0,
  "ffn_1_dropout": 0.1,
  "ffn_2_dropout": 0.1,
  "layers": 2,
  "model_type": "st_linear",
  "num_heads": 8,
  "patch_size": 16,
  "pred_len": 1,
  "projection_dim": 128,
  "rec_dim": 128,
  "rec_query_dropout": 0.0,
  "seq_len": 12,
  "spatio_topk": 50,
  "temperature": 0.1,
  "temporal_dim": 128,
  "temporal_ffn": 256,
  "temporal_proj": false,
  "transformers_version": "5.3.0",
  "use_cache": false
}
