{
  "architectures": [
    "TQNet"
  ],
  "cycle_len": 24,
  "d_model": 512,
  "dropout": 0.5,
  "dtype": "float32",
  "enc_in": 7,
  "model_type": "time_mixer",
  "pred_len": 96,
  "seq_len": 96,
  "transformers_version": "5.3.0",
  "use_cache": false,
  "use_revin": true
}
