{
  "act": "gelu",
  "activation": "gelu",
  "affine": false,
  "architectures": [
    "PatchTST"
  ],
  "attn_dropout": 0.0,
  "attn_mask": null,
  "d_ff": 256,
  "d_k": null,
  "d_model": 128,
  "d_v": null,
  "decomposition": 0,
  "dropout": 0.2,
  "dtype": "float32",
  "e_layers": 3,
  "enc_in": 7,
  "fc_dropout": 0.2,
  "head_dropout": 0.0,
  "head_type": "flatten",
  "individual": false,
  "kernel_size": 25,
  "key_padding_mask": "auto",
  "learn_pe": true,
  "max_seq_len": 1024,
  "model_type": "patchtst",
  "n_heads": 8,
  "norm": "BatchNorm",
  "padding_patch": "end",
  "padding_var": null,
  "patch_len": 3,
  "pe": "zeros",
  "pre_norm": false,
  "pred_len": 1,
  "pretrain_head": false,
  "res_attention": true,
  "revin": true,
  "seq_len": 12,
  "store_attn": false,
  "stride": 1,
  "subtract_last": 0,
  "transformers_version": "5.3.0",
  "use_cache": false,
  "verbose": false
}
