{
  "architectures": [
    "DP_LET_Predictor"
  ],
  "attn_drop_rate": 0.0,
  "drop_rate": 0.2,
  "dtype": "float32",
  "embed_type": "timeF",
  "fc_drop_rate": 0.2,
  "flatten_drop_rate": 0.0,
  "if_decomp": false,
  "if_decompose": false,
  "if_denoise": false,
  "if_revin": true,
  "model_type": "dp_let",
  "num_heads": 16,
  "num_hidden": 128,
  "num_hidden_ff": 256,
  "num_hidden_key_per_head": "",
  "num_hidden_value_per_head": "",
  "num_layers": 3,
  "num_nodes": 100,
  "padding_patch": "end",
  "patch_lens": 4,
  "patch_size": 16,
  "pred_len": 1,
  "res_attn_scores": true,
  "seq_len": 12,
  "stride": 2,
  "svd_cut": 6,
  "transformers_version": "5.3.0",
  "use_cache": false
}
